<template>
  <div class="container">
    <Back />
    <div class="title">公告详情</div>
    <div class="content">
      <div class="title">{{ data.title }}</div>
      <div class="message">
        {{ data.message }}
      </div>
      <div class="date">{{ data.date }}</div>
      <div class="footer">InitVerse</div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";
import { useRoute } from "vue-router";
import Back from "../components/back.vue";
import { onBeforeMount } from "vue";
const route = useRoute();
console.log("🚀 ~ route:", route)
const data = ref({
  title: "hhdadakda打打卡",
  message: "打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋打打打了多久啦就是大家开始的到底后期我和我全屋",
  date: "2024/09/06 00:00:00",
});
onBeforeMount(() => {});
</script>
<style lang="scss" scoped>
.container {
  padding: 0 30px;
  height: calc(100vh - 124px);
  display: flex;
  flex-direction: column;
  .title {
    font-weight: 500;
    font-size: 34px;
    color: #ffffff;
    line-height: 40px;
    text-align: center;
  }
  .content {
    flex: 1;
    overflow: auto;
    background: linear-gradient(223deg, #353342 0%, #383b52 100%);
    border-radius: 20px 20px 20px 20px;
    padding: 30px;
    margin-top: 22px;
    .message {
      margin-top: 30px;
      font-weight: 400;
      font-size: 28px;
      color: #aeaec3;
      line-height: 33px;
    }
    .date {
      margin-top: 200px;
      font-weight: 400;
      font-size: 28px;
      color: #aeaec3;
      line-height: 33px;
      text-align: right;
    }
    .footer {
      font-weight: 400;
      font-size: 30px;
      color: #ffffff;
      line-height: 35px;
      text-align: right;
    }
  }
}
</style>
